app/Controllers/Home.php

    public function enlistar(){
        $personajesBD = $this->conectarBD();

        $nuevoPersonaje = ['nombre'=>'','miniatura'=>'','descripcion'=>''];

        $nuevoPersonaje['nombre'] = $_GET['nombre'];
        $nuevoPersonaje['miniatura'] = $_GET['miniatura'];
        $nuevoPersonaje['descripcion'] = $_GET['descripcion'];


        $personajesBD->save($nuevoPersonaje);
---
INSERT INTO `personaje` (`nombre`, `miniatura`, `descripcion`) VALUES ('A.I.M.', 'http://i.annihil.us/u/prod/marvel/i/mg/6/20/52602f21f29ec.jpg', 'AIM is a terrorist organization bent on destroying the world.')