app/Controllers/Personaje.php

    public function guardar() {
        $personajesBD = $this->conectarBD();

        $nuevoPersonaje = ['nombre'=>'','miniatura'=>'','descripcion'=>''];

        $nuevoPersonaje['nombre'] = $_POST['nombre'];
        $nuevoPersonaje['miniatura'] = $_POST['miniatura'];
        $nuevoPersonaje['descripcion'] = $_POST['descripcion'];

        $personajesBD->save($nuevoPersonaje);
---
INSERT INTO `personaje` (`nombre`, `miniatura`, `descripcion`) VALUES ('Hulk', 'https://upload.wikimedia.org/wikipedia/en/a/aa/Hulk_%28circa_2019%29.png', 'The Hulk is a superhero appearing in American comic books published by Marvel Comics. Created by writer Stan Lee and artist Jack Kirby, the character first appeared in the debut issue of The Incredible Hulk (May 1962).')

    public function actualizar(){
        $personajesBD = $this->conectarBD();

        $nuevoPersonaje = ['nombre'=>'','miniatura'=>'','descripcion'=>''];

        $nuevoPersonaje['nombre'] = $_POST['nombre'];
        $nuevoPersonaje['miniatura'] = $_POST['miniatura'];
        $nuevoPersonaje['descripcion'] = $_POST['descripcion'];

        $personajesBD->where('nombre',$nuevoPersonaje['nombre'])
        ->set(['miniatura'=>$nuevoPersonaje['miniatura'],'descripcion'=>$nuevoPersonaje['descripcion']])
        ->update();
---
UPDATE `personaje` SET `miniatura` = 'https://sm.ign.com/t/ign_latam/screenshot/default/hulk-inmortal_cxnp.1280.jpg', `descripcion` = 'The Hulk is a superhero appearing in American comic books published by Marvel Comics. Created by writer Stan Lee and artist Jack Kirby, the character first appeared in the debut issue of The Incredible Hulk (May 1962).'
WHERE `nombre` = 'Hulk'